/**
 * @todo 基礎練習
*/
    // 1. 列印出 'abc'

    // 2. 把以下的變數重新賦值 並列印出來

/*--------------------------------------------------------*/




/**
 * @todo 字串練習 
*/
    // 1. 把 以下字串 拆成 array，並把每一個元素加上 1，印出結果

    // 2. 把以下字串的空格，用 = 分隔開來

/*--------------------------------------------------------*/




/**
 * @todo 陣列練習 
*/
    const strArray = ["a", "b", 1, 5]

    // 1. 新增元素 20 到最後。

    // 2. 移除第一個元素

    // 3. 合併以下陣列到 strArray中

    // 4. 遍歷陣列 strArray，並打印出來 ( 用for loop )

    // 5. 遍歷陣列 strArray，並打印出來 ( 用 map )

    // 6. 過濾陣列 strArray，只留下 類型為 字串的元素 ( 用for loop )

    // 7. 過濾陣列 strArray，只留下 類型為 字串的元素 ( 用 filter )
    
/*--------------------------------------------------------*/




/**
 * @todo object練習
*/
    const phone = {
        width: 500,
        height: 800,
        brand: "",
        hi: 'hi'
    }

    // 1. 新增屬性 price 為 40000
    
    // 2. 刪除屬性 hi

    // 3. 編輯屬性 width 變為 400

    // 4. 建立一個新的 object , 並為新的object 新增屬性 name

    // 5. 遍歷phone，並且打印出裡面的資料，打印格式為 key => value

/*--------------------------------------------------------*/



/**
 * @todo object array 複合練習
*/
    const computer = {
        width: 500,
        height: 800,
        brand: "",
        hi: 'hi'
    }

    let computerArray = [
        computer,
        computer,
        computer
    ]

    // 1. 移除第一台電腦

    // 2. 新增 兩台電腦到最後。

    // 3. 更改 computerArray ， 把每一台computer 的屬性都改的不相同、不重複。 ( 用 map )
 

/*--------------------------------------------------------*/




/**
 * @todo 函式練習 -- 宣告一個函示，該功能需要滿足以下數學式，有兩個參數 a、b，並回傳結果
 * @description 數學式 = (a - b)(a ^ 2 + ab + b ^ 2)
*/

/*--------------------------------------------------------*/